<template>
  <div id="posts">
    <div id="posts_container" class="pb-5 mb-5">
      <div class="post-box" v-for="item in posts_test_count">
        <div class="img-loader">
          <img src="http://picsum.photos/700/400" class="post-cover-img" />
        </div>
        <h2 class="post-header">
          آموزش ساخت یک وب سرور ساده با Flask در پایتون
        </h2>
        <p class="post-description">
          آموزش ساخت یک وب سرور ساده با فلاسک در پایتون... لورم ایپسوم متن
          ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان
          گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که
          لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با
          هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم
          افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی،
          و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت
          که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان
          رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات
          پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
        </p>
        <div class="post-read-more">
          <nuxt-link to="/posts/Hello-World" class="dvsp-button"
            >ادامه مطلب</nuxt-link
          >
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      posts_test_count: 20,
      posts: [],
    }
  },
}
</script>
